<template>
  <div class="content">
    <div class="titleTop backBlue">
      <i class="fi fi-rr-angle-left"></i>
      <h5>마이페이지</h5>
    </div>
    <b-tabs justified class="myTab">
        <b-tab title="개인정보" active>
           <div class="container"> 
                <div class="subTop">
                    <img src="../../public/img/login.png">
                    <div class="subTopTxt">
                        <span class="idEmail">{{ idEmail }}</span><br>
                        수검자님 안녕하세요.<br>
                        <div class="smallTxt">정보 변경을 원하시면, 
            빈칸 입력 후 확인을 눌러주세요</div>
                    </div>
                </div>  
                <b-card bg-variant="white" text-variant="dark" class="basicCard" header="개인정보 변경">
                        
                        <b-card-text>
                            <b-form class="accountEdit">
                                <label for="text-password">비밀번호 변경</label>
                                <b-form-input type="password" id="password" placeholder="현재 비밀번호를 입력해주세요." class="bottomMargin05"></b-form-input>
                                <b-form-input type="password" id="passwordNew" placeholder="변경하실 비밀번호를 입력해주세요." class="bottomMargin1"></b-form-input>
                            </b-form>  
                            <b-button block variant="primary">확 인</b-button>            
                        </b-card-text>
                        
                    </b-card> 
                </div><!--개인정보-->
        </b-tab>
        <b-tab title="MY기록">
            <div class="container"> 
                <div class="subTop">
                    <img src="../../public/img/search.png">
                    <div class="subTopTxt">
                        <span class="idEmail">{{ idEmail }}</span><br>
                        수검자님 안녕하세요.<br>
                        <div class="smallTxt">수검자님이 지금까지 받으신
검사결과 기록 입니다.</div>
                    </div>
                </div>  
                <b-card bg-variant="white" text-variant="dark" class="basicCard" header="검사결과 기록">
                        <b-card-text>
                            <ul class="testList">
                                <li><i class="fi fi-rr-calendar"></i> {{ examDate }} 검사결과</li>
                                <li><i class="fi fi-rr-calendar"></i> {{ examDate }} 검사결과</li>
                                <li><i class="fi fi-rr-calendar"></i> {{ examDate }} 검사결과</li>
                                <li><i class="fi fi-rr-calendar"></i> {{ examDate }} 검사결과</li>
                                <li><i class="fi fi-rr-calendar"></i> {{ examDate }} 검사결과</li>
                            </ul>          
                        </b-card-text>
                        
                    </b-card> 
                </div><!--MY기록-->
        </b-tab>
        <b-tab title="회원탈퇴">
           <div class="container"> 
                <div class="subTop">
                    <img src="../../public/img/front-end.png">
                    <div class="subTopTxt">
                        <span class="idEmail">{{ idEmail }}</span><br>
                        수검자님 안녕하세요.<br>
                        <div class="smallTxt">탈퇴하시면 모든 데이터와 
정보가 삭제됩니다.</div>
                    </div>
                </div>  
                <b-card bg-variant="white" text-variant="dark" class="basicCard" header="회원탈퇴">
                       
                        <b-card-text>
                            <b-form class="accountDelete">
                                <b-form-input type="password" id="password" placeholder="비밀번호를 입력해주세요." class="bottomMargin1"></b-form-input>
                            </b-form>  
                            <b-button block variant="primary">확 인</b-button>            
                        </b-card-text>
                        
                    </b-card> 
                </div><!--회원탈퇴-->
        </b-tab>
        <b-tab title="서비스정책">
            <div class="container topMargin1 servicePolicy"> 
                <b-card bg-variant="white" text-variant="dark" class="basicCard" header="이용 약관">
                    <b-card-text>
                        <div class="cardTxt">
                        <div class="txtBold">Rex 유로바이옴 서비스 이용약관</div>
                        Rex 유로바이옴 서비스와 관련 서비스의 이용과 관련하여 필요한 사항을 규정하는 이용약관(이하 “약관”)은 다음과 같습니다. <br><br>

                        <div class="txtBold">제1조 목적</div>
                        이 약관은 ㈜렉스소프트(이하”회사”)가 운영하는 Rex 유로바이옴 서비스 (이하 ”서비스”) 이용과 관련하여 회사와 이용자의 권리, 의무 및 책임 사항을 규정함을 목적으로 합니다.<br><br>

                        <div class="txtBold">제2조 정의 </div>
                        ① 본 약관에서 사용하는 용어의 정의는 다음과 같습니다.<br> 
                        가) “서비스”라 함은 구현되는 단말기(PC, 휴대형단말기 등의 유무선 장치를 포함)와 상관없이 “회원”이 이용할 수 있는 Rex 유로바이옴 관련 제반 서비스를 말합니다.<br>
                        나) "회원"이란 "서비스"에 접속하여 본 약관에 동의하여 회원등록을 한 자로서 본 약관에 따라 “회사”가 제공하는 서비스를 이용할 수 있는 고객을 의미합니다.<br>
                        다) “마이크로바이옴검사결과”란 마이크로바이옴 검사 결과 내용을 전자화된 형태로 변환한 데이터입니다. <br>
                        라) “질환위험도예측”이란 마이크로바이옴 검사 결과를 기반으로 산출한 질환 위험도를 전자화된 형태로 변환한 데이터입니다. <br>
                        마) “추천관리방법”이란 마이크로바이옴 검사 결과를 기반으로 식이 관리, 운동 관리, 생활습관 관리 방법을 추천하는 서비스입니다. <br>
                        ② 본 약관에서 사용하는 용어의 정의는 제1항에서 정하는 것을 제외하고는 관계법령 및 서비스별 정책에서 정하는 바에 의하며, 이에 정하지 아니한 것은 일반적인 상관례에 따릅니다. <br><br>

                        <div class="txtBold">제3조 약관 등의 명시와 설명 및 개정</div>
                        ① “회사”는 본 약관의 내용에 사용자가 접근할 수 있도록 “모바일 어플리케이션” 내에 게시합니다.<br>
                        ② “회사”는 불가피한 사정이 있는 경우 관계법령을 위배하지 않는 범위에서 본 약관을 개정할 수 있습니다.<br>
                        ③ “회사”는 사정상 변경의 경우와 영업상 중요 사유가 발생한 경우에는 이 약관을 변경할 수 있으며, 변경된 약관은 제1항과 같은 방법으로 공지 또는 통보함으로써 효력이 발생합니다.<br>
                        ④ 본 약관에서 정하지 아니한 사항과 본 약관의 해석에 관하여는 관계법령 또는 상관례에 따릅니다.<br><br>

                        <div class="txtBold">제5조 서비스의 중단 </div>
                        ① "회사"는 서버 등 정보통신설비의 보수점검·교체 및 고장, 통신의 두절 등의 사유가 발생한 경우에는 서비스의 제공을 일시적으로 중단할 수 있고, 새로운 서비스로의 교체 등 사정변경으로 인하여 현재 제공되는 서비스를 완전히 중단할 수 있습니다.<br>
                        ② 제1항에 의한 서비스 중단의 경우에는 "회사"는 제8조 제2항에서 정한 방법으로 "회원"에게 통지합니다. 다만, "회사"가 통제할 수 없는 사유로 인한 서비스의 중단(시스템 관리자의 고의, 과실이 없는 디스크 장애, 시스템 다운 등)으로 인하여 사전 통지가 불가능한 경우에는 그러하지 아니합니다.<br>
                        ③ "회사"는 제1항 또는 제2항을 통해 서비스를 중단하는 경우 이로 인하여 "회원"이 입은 손해에 대하여 배상하지 아니합니다. 단, "회사"의 고의 또는 중과실이 있는 경우에는 그러하지 아니합니다.<br><br>

                        <div class="txtBold">제6조 회원가입</div>
                        ① 회원가입은 "회원"이 되고자 하는 자(이하 "가입신청자")가 “회사”의 서비스 내용에 대하여 동의를 한 다음 "회사"가 정한 가입 양식에 따라 회원 정보를 기입하여 회원가입 신청을 합니다.<br>
                        ② "회사"는 제1항과 같이 가입신청자가 다음 각 호에 해당하지 않는 한 가입신청자를 회원으로 등록합니다.<br>
                        가) 가입신청자가 본 약관 제7조 제3항에 의하여 이전에 회원 자격을 상실한 적이 있는 경우. 다만, 제7조 제3항에 의한 회원자격을 상실한 자로서 "회사"의 회원 재가입 승낙을 얻은 경우에는 예외로 합니다.<br>
                        나) 등록 내용에 허위, 기재 누락, 오기(誤記)가 있는 경우<br>
                        다) 기타 회원으로 등록하는 것이 기술상 문제 등으로 인하여 "회사"의 영업에 현저한 지장을 초래하는 경우<br>
                        ③ 회원가입계약의 성립 시기는 "회사"의 승낙이 가입 신청자에게 도달한 시점으로 합니다.<br>
                        ④ 회원은 제1항의 회원 정보 기재 내용에 변경이 발생한 경우, 즉시 변경사항을 수정하여 기재하여야 하고, 수정을 지연함으로써 발생되는 손해에 대해서는 회사가 책임지지 않습니다.<br><br>

                        <div class="txtBold">제7조 회원 탈퇴 및 자격 상실 등</div>
                        ① "회원"은 "회사"에 언제든지 탈퇴를 요청할 수 있으며, "회사"는 즉시 회원 탈퇴를 처리합니다.<br>
                        ② "회원"이 다음 각 호의 사유에 해당하는 경우, "회사"는 회원자격을 적절한 방법으로 제한 및 정지, 상실시킬 수 있습니다.<br>
                        가) 가입 신청 시에 허위 내용을 등록한 경우<br>
                        나) 다른 사람의 서비스 이용을 방해하거나 그 정보를 도용하는 등 전자거래질서를 위협하는 경우<br>
                        다) 서비스를 이용하는 과정에서 법령 또는 본 약관이 금지하거나 공서양속에 반하는 행위를 하는 경우<br>
                        ③ "회사"가 회원자격을 상실시키기로 결정한 경우에는 회원 등록을 말소할 수 있습니다. 이 경우 회원에게 회원 등록 말소 전에 이를 통지하고, 소명할 기회를 부여합니다.<br>

                        <div class="txtBold">제8조 회원에 대한 통지</div>
                        ① "회사"가 특정 회원에 대한 통지를 하는 경우 "회원"이 "회사"에 제공한 이메일 주소로 할 수 있습니다.<br>
                        ② "회사"는 불특정다수 회원에 대한 통지의 경우 앱을 통한 팝업 메시지로 안내함으로써 개별 통지에 갈음할 수 있습니다.<br><br>

                        <div class="txtBold">제9조 개인정보보호</div>
                        ① “회사”는 “회원”의 개인정보를 수집, 이용하는 때에는 당해 사용자에게 그 목적을 고지하고 동의를 받습니다.<br>
                        ② “회사”는 수집된 개인정보를 목적 외의 용도로 이용할 수 없으며, 새로운 이용목적이 발생한 경우 또는 제3자에게 제공하는 경우에는 이용, 제공 단계에서 당해 “회원”에게 그 목적을 고지하고 동의를 받습니다. 다만, 관련 법령에 달리 정함이 있는 경우에는 예외로 합니다.<br>
                        ③ “회사”는 제1항과 제2항에 의해 “회원”의 동의를 받아야 하는 경우에는 개인정보관리 책임자의 신원(소속, 성명 및 전화번호, 기타 연락처), 정보의 수집목적 및 이용목적, 제3자에 대한 정보제공 관련 사항(제공받은 자, 제공목적 및 제공할 정보의 내용) 등 「정보통신망 이용촉진 및 정보보호 등에 관한 법률」 등 관련 법령이 정한 사항을 미리 명시하거나 고지해야 하며, “회원”은 언제든지 이 동의를 철회할 수 있습니다.<br>
                        ④ “회원”은 언제든지 자신의 회원정보를 조회하거나 수정 요구할 수 있으며 “회사”는 이에 대해 필요한 조치를 취할 의무를 집니다. “회사”는 조회 및 수정을 위해 필요한 본인확인 및 증빙자료를 요청할 수 있습니다.<br>
                        ⑤ “회사”는 “회원”의 개인정보의 보안에 대하여 기술적 안전 조치를 강구하고 관리에 만전을 기함으로써 사용자의 정보보안을 위하여 노력합니다.<br>
                        ⑥ “회사” 또는 그로부터 개인정보를 제공받은 제3자는 개인정보의 수집목적 또는 제공받은 목적을 달성한 때에는 당해 개인정보를 지체 없이 파기합니다.<br><br>

                        <div class="txtBold">제10조 회사의 의무</div>
                        ① “회사”는 법령과 본 약관이 금지하거나 공서양속에 반하는 행위를 하지 않으며, 본 약관이 정하는 바에 따라 지속적이고 안정적으로 서비스를 제공하기 위해서 노력합니다.<br>
                        ② “회사”는 “회원”이 안전하게 서비스를 이용할 수 있도록 “회원”의 개인정보보호를 위한 보안 시스템을 갖추어야 합니다.<br>
                        ③ “회사”는 서비스 이용과 관련하여 발생하는 “회원”의 불만 또는 피해구제요청을 적절하게 처리할 수 있도록 필요한 인력 및 시스템을 구비합니다.<br>
                        ④ "회사"는 "서비스" 이용과 관련하여 "회원"으로부터 제기된 의견이나 불만이 정당하다고 인정할 경우에는 이를 처리하여야 합니다. "회원"이 제기한 의견이나 불만사항에 대해서는 알림 기능 등을 통하여 "회원"에게 처리과정 및 결과를 전달합니다.<br><br>

                        <div class="txtBold">제11조 회원의 의무</div>
                        ① 사용자는 다음 각 호의 행위를 하여서는 안됩니다.<br>
                        가) 회원가입신청 또는 변경 시 허위내용을 등록하는 행위<br>
                        나) "회사" 및 기타 제3자의 인격권 또는 지적재산권을 침해하거나 업무를 방해하는 행위<br>
                        다) 다른 “회원”의 정보를 도용하는 행위<br>
                        라) "회사"가 게시한 정보의 변경<br>
                        마) 다른 “회원”에 대한 개인정보를 동의 없이 수집, 저장, 공개하는 행위<br>
                        바) “회사”가 제공하는 서비스에 정한 약관 혹은 기타 서비스 이용에 관한 규정을 위반하는 행위<br>
                        ② 제1항에 해당하는 행위를 한 “회원”이 있을 경우 "회사"는 본 약관 제7조 제2항 및 제3항에서 정한 바에 따라 사용자의 회원자격을 적절한 방법으로 제한 및 정지, 상실시킬 수 있습니다.<br><br>

                        <div class="txtBold">제12조 저작권의 귀속 및 이용제한</div>
                        ① "회사"의 저작물에 대한 저작권 기타 지적재산권은 "회사"에 귀속합니다.<br>
                        ② “회원”은 "서비스"를 이용함으로써 얻은 정보 중 "회사"에게 지적재산권이 귀속되는 정보를 "회사"의 사전승낙 없이 복제, 전송, 출판, 배포, 방송 기타 방법에 의하여 영리목적으로 이용하거나 제3자에게 이용하게 하여서는 안됩니다.<br><br>

                        <div class="txtBold">부칙</div>
                        ※ 본 약관은 2022년 04월 15일부터 적용합니다.

                        </div>
                    </b-card-text>
                </b-card>
                <b-card bg-variant="white" text-variant="dark" class="basicCard servicePolicy" header="개인정보 취급방침">
                    <b-card-text>
                        <div class="cardTxt">
                        <div class="txtBold">개인정보 수집·이용에 대한 안내</div>
                        (주)렉스소프트(이하 "회사")는 개인정보보호법, 통신비밀보호법, 전기통신사업법 등 정보통신서비스제공자가 준수하여야 할 관련 법령상의 개인정보보호 관련 규정을 준수하며, 다음과 같이 개인정보 보호법 제30조에 따른 개인정보처리방침을 수립·공개하여 이용자 권익 보호에 최선을 다하고 있습니다.<br>
                        본 개인정보처리방침은 회사가 제공하는 "어플리케이션 (Rex 유로바이옴)" (이하 "서비스") 이용에 적용되며 다음과 같은 내용을 담고 있습니다.<br><br>

                        <div class="txtBold">1. 개인정보의 처리 목적</div>
                        "회사"는 회원가입, 각종 서비스의 제공을 위해 아래와 같은 최소한의 개인정보를 필수항목으로 수집하고 있습니다.<br>
                        "회사"는 다음의 목적을 위하여 개인정보를 처리합니다. "회사"는 처리하고 있는 개인정보는 다음의 목적 이외의 용도로는 이용되지 않으며, 이용 목적이 변경되는 경우에는 개인정보 보호법 제18조에 따라 별도의 동의를 받는 등 필요한 조치를 이행할 예정입니다.<br><br>
                        - 회원 가입 및 관리<br>
                        회원 가입의사 확인, 회원제 서비스 제공에 따른 본인 식별ㆍ인증, 회원자격 유지ㆍ관리, 제한적 본인확인제 시행에 따른 본인확인, 서비스 부정이용 방지, 각종 고지ㆍ통지, 불법/부정 이용 방지, 고충처리 등을 목적으로 개인정보를 처리합니다.<br><br>
                        - 각종 서비스 제공<br>
                        마이크로바이옴 검사결과, 질환 위험도 예측, 추천 관리 방법 서비스를 목적으로 개인정보를 처리합니다.<br><br>
                        - 안정적인 서비스 운영 및 제공을 위한 안전성 테스트 및 모니터링<br><br>

                        <div class="txtBold">2. 처리하는 개인정보 항목 및 보유기간</div>
                        “회사”는 법령에 따른 개인정보 보유ㆍ이용기간 또는 정보주체로부터 개인정보를 수집 시에 동의 받은 개인정보 보유ㆍ이용기간 내에서 개인정보를 처리ㆍ보유합니다.<br>
                        이용자(이하 "회원") 개인정보의 구체적인 처리 목적 및 항목은 아래와 같습니다.<br><br>
                        ※ 필수항목<br>
                        - 구분 : 회원가입 / 이메일<br>
                        - 수집방법 : 검사 수행 시 / 회원가입 시	<br>
                        - 이용목적 : 회원가입 및 회원 관리<br>	
                        - 수집/이용 항목 : 이메일<br>	
                        - 보유기간 : 서비스 회원 탈퇴 및 이용계약 종료 시 (단, 관련 법령에 따라 별도 보관되는 정보는 예외)<br><br>
                        "회사"는 귀하의 개인정보 보호를 매우 중요시하며, 개인정보 보호법 및 개인정보보호위원회가 제정한 표준 개인정보 보호지침 등 관련 규정을 준수하고 있습니다. 회사는 본 개인정보처리방침을 통하여 귀하께서 제공하시는 개인정보가 어떠한 용도와 방식으로 이용되고 있으며, 개인정보보호를 위해 어떠한 조치가 취해지고 있는지 알려드립니다.<br>
                        "회사"는 개인정보 처리방침을 마이페이지의 '서비스정책 개인정보처리방침' 항목에서 공개함으로써 회원들이 언제나 용이하게 보실 수 있도록 조치하고 있습니다.<br>
                        "회사"는 개인정보 처리방침의 지속적인 개선을 위하여 개인정보 처리방침을 개정하는데 필요한 절차를 정하고 있습니다. 그리고 개인정보 처리방침을 개정하는 경우 버전번호 등을 부여하여 개정된 사항을 귀하께서 쉽게 알아볼 수 있도록 하고 있습니다.<br><br>

                        <div class="txtBold">3. 개인정보의 처리 및 보유 기간</div>
                        “회원”의 개인정보는 그 수집목적 또는 제공받은 목적이 달성되거나 “회원”이 이용계약 해지(회원탈퇴)를 요청한 경우 파기하는 것을 원칙으로 하며, 자세한 보유 기간은 본 개인정보 처리방침 제2항(처리하는 개인정보 항목 및 보유기간)을 참고하시기 바랍니다.<br>
                        회원의 개인정보는 보유 기간 초과 시 재생할 수 없는 방법에 의하여 시스템에서 완전히 삭제되며 어떠한 용도로도 열람 또는 이용할 수 없도록 처리됩니다. <br>
                        상법, 전자상거래 등에서의 소비자보호에 관한 법률 등 관계법령의 규정에 의하여 보존할 필요가 있는 경우 회사는 관계법령에서 정한 일정한 기간 동안 회원정보를 보관합니다. 이 경우 회사는 보관하는 정보를 그 보관의 목적으로만 이용하며 보존기간은 아래와 같습니다.<br><br>
                        ※ 법령에 의하여 수집 및 이용되는 정보<br>
                        가. 전자상거래 등에서의 소비자 보호에 관한 법률<br>
                        - 대금결제 및 재화 등의 공급에 관한 기록 : 5년<br>
                        - 소비자의 불만 또는 분쟁처리에 관한 기록 : 3년<br>
                        - 표시/광고에 관한 기록 : 6개월<br><br>
                        나. 통신비밀보호법<br>
                        - 서비스 방문 기록 : 3개월<br><br>

                        <div class="txtBold">4. 개인정보 파기절차 및 방법</div>
                        “회원”의 개인정보는 원칙적으로 보유기간의 경과, 개인정보의 수집 및 이용목적 달성 등 그 개인정보가 불필요하게 되었을 때에는 지체 없이 파기합니다. “회사”의 개인정보 파기절차 및 방법은 다음과 같습니다.<br><br>
                        가. 파기절차<br>
                        - 회사는 개인정보의 파기에 관한 사항을 기록하고 관리하며, 파기는 개인정보 보호책임자의 책임하에 수행되며, 개인정보 보호책임자는 파기 결과를 확인합니다.<br>
                        - 회사는 다른 법령에 따라 보존해야 하는 경우에는 예외적으로 회원의 개인정보를 파기하지 않을 수 있습니다.<br><br>
                        나. 파기방법<br>
                        - 종이나 그 밖의 기록매체에 저장된 개인정보는 파쇄하거나 소각합니다.<br>
                        - 전자적 파일 형태로 저장된 개인정보는 복원이 불가능한 방법(내지 기록을 재생할 수 없는 기술적 방법)으로 영구 삭제합니다.<br><br>
                        다. 미파기 정보의 보존방법<br>
                        - 회사는 법령에 따라 개인정보를 파기하지 않고 보존하는 경우에 해당 개인정보 또는 개인정보파일을 다른 개인정보와 분리하여 저장 관리합니다. 회사는 별도 DB로 옮긴 개인정보를 법률에 의한 경우가 아니고서는 보유하는 이외의 다른 목적으로 이용하지 않습니다.<br><br>

                        <div class="txtBold">5. 개인정보주체와 법정대리인의 권리와 의무 및 그 행사방법</div>
                        가. 회원은 언제든지 회사에 "Rex 유로바이옴" 서비스를 통하여 등록되어 있는 자신의 개인정보, 회사가 회원의 개인정보를 이용하거나 회사에게 개인정보 수집, 이용, 제공 등의 동의를 한 현황에 대하여 열람이나 제공을 요구할 수 있고, 오류가 있는 경우에는 그 정정을 요구할 수 있으며, 삭제 내지 가입해지를 요구할 수도 있습니다.<br>
                        나. 회원 개인정보 조회, 수정을 위해서는 “개인정보변경”, 가입해지(동의철회)를 위해서는 "회원탈퇴"를 클릭하여 본인 확인 절차를 거치신 후 직접 열람, 정정 또는 탈퇴가 가능합니다.<br>
                        다. 이 경우에 회사는 지체 없이 그 개인정보를 조사하여 회원의 요구에 따라 정정, 삭제 등 필요한 조치를 한 후 그 결과를 회원에게 알립니다. 회사는 필요한 조치를 할 때까지는 해당 개인정보를 이용하거나 제공하지 않습니다.<br>
                        라. 회원은 언제든지 회사에 자신의 개인정보 처리의 정지를 요구할 수 있으며, 이 경우에 회사는 지체 없이 그 요구에 따라 개인정보 처리의 전부 내지 일부를 정지하며, 처리가 정지된 개인정보에 대하여 지체 없이 그 개인정보의 파기 등 필요한 조치를 취합니다.<br>
                        마. 개인정보와 관련하여 의의나 의견이 있으신 분은 개인정보 보호책임자 및 담당자에게 서면, 전화 또는 E-mail로 연락하시면 접수 즉시 처리하고 결과를 안내해 드리겠습니다. 로그인(log-in)한 상태에서는 주위의 다른 사람에게 개인정보가 유출되지 않도록 특별히 주의를 기울이시기 바랍니다.<br><br>

                        <div class="txtBold">6. 개인정보의 안정성</div>
                        가. 회사는 회원들의 개인정보를 취급함에 있어 개인정보가 분실, 도난, 유출, 변조 또는 훼손되지 않도록 안전성 확보를 위하여 다음과 같은 기술적 대책을 강구하고 있습니다.<br>
                        - 개인정보 보호책임자의 지정 등 개인정보 보호 조직의 구성 및 운영에 관한 사항 등을 포함하여 개인정보 내부관리계획을 수립하고, 매년 내부관리계획을 잘 시행하고 있는지를 점검하고 있습니다.<br>
                        - 회원의 개인정보는 비밀번호에 의해 보호되며 파일 및 전송데이터를 암호화하거나 파일 잠금기능(Lock)을 사용하여 중요한 데이터는 별도의 보안기능을 통해 보호되고 있습니다.<br>
                        - 회사는 백신프로그램을 이용하여 컴퓨터바이러스에 의한 피해를 방지하기 위한 조치를 취하고 있습니다. 백신프로그램은 주기적으로 업데이트되며 갑작스런 바이러스가 출현할 경우 백신이 나오는 즉시 이를 제공함으로써 개인정보가 침해되는 것을 방지하고 있습니다.<br>
                        - 해킹 등 외부침입에 대비하여 각 서버마다 침입차단시스템 및 취약점 분석시스템 등을 이용하여 보안에 만전을 기하고 있습니다.<br>
                        - 개인정보에 대한 불법적인 접근을 차단하기 위해 개인정보 처리시스템에 대한 접근 권한의 부여 ㆍ변경 ㆍ말소 등에 관한 기준을 수립하여 시행하고 있으며, 침입차단시스템 및 침입탐지시스템을 설치ㆍ운영하고 있습니다. 또한 개인정보를 처리하는 직원을 최소한으로 관리하고 있습니다.<br>
                        - 개인정보취급자가 개인정보처리시스템에 접속한 기록을 보관ㆍ관리하며, 개인정보의 오ㆍ남용, 분실ㆍ위조ㆍ변조 등을 방지하기 위하여 접속기록 등을 정기적으로 점검하며, 개인정보취급자의 접속기록이 위ㆍ변조 및 도난, 분실되지 않도록 해당 접속기록을 안전하게 보관하고 있습니다.<br>
                        - 개인정보의 훼손에 대비하여 자료를 수시로 백업하고 있고, 이용자들의 개인정보나 자료가 유출되거나 손상되지 않도록 방지하고 있습니다.<br><br>
                        나. 관리적인 대책<br>
                        - 위와 같은 노력 이외에 회원님 스스로도 제3자에게 비밀번호 등이 노출되지 않도록 주의하셔야 합니다. 특히 비밀번호 등이 공공장소에 설치한 PC를 통해 유출되지 않도록 항상 유의하시기 바랍니다. 회원님의 ID와 비밀번호는 반드시 본인만 사용하고 비밀번호를 정기적으로 바꿔 주시는 것이 좋습니다.<br>
                        - 회사는 회원의 개인정보에 대한 접근권한을 최소한의 인원으로 제한하고 있으며 회원을 직접 상대로 하여 마케팅 업무를 수행하는 자, 개인정보 보호책임자 및 담당자 등 개인정보관리업무를 수행하는 자, 기타 업무상 개인정보의 취급이 불가피한 자 외에는 접근을 엄격히 제한하고 담당직원에 대한 수시 교육을 통하여 본 정책의 준수를 강조하고 있습니다. 단, 회원 본인의 부주의나 인터넷상의 문제로 ID, 비밀번호, 개인정보가 유출해 발생한 문제에 대해 회사는 일체의 책임을 지지 않습니다.<br><br>

                        <div class="txtBold">7. 개인정보관련 의견수렴 및 침해, 불만처리에 관한 사항</div>
                        가. 회사는 개인정보보호와 관련하여 회원들의 의견을 수렴하고 있으며 불만을 처리하기 위하여 모든 절차와 방법을 마련하고 있습니다. 회원들은 하단에 명시한 개인정보 보호책임자 및 담당자 조항을 참고하여 전화나 메일을 통하여 불만사항을 신고할 수 있고, 회사는 회원들의 신고사항에 대하여 신속하게 처리하여 답변해 드립니다.<br><br>
                        나. 또는 정부에서 설치하여 운영 중인 아래의 기관에 불만처리를 신청할 수 있습니다.<br>
                        - 개인정보침해신고센터 (www.1336.or.kr / 1336)<br>
                        - 정보보호마크인증위원회 (www.eprivacy.or.kr / 02-580-0533)<br>
                        - 대검찰청 첨단범죄수사과 (www.spo.go.kr / 02-3480-2000)<br>
                        - 경찰청 사이버테러대응센터 (www.ctrc.go.kr / 02-393-9112)<br><br>

                        다. 개인정보 보호책임자 및 담당자 회사는 회원이 좋은 정보를 안전하게 이용할 수 있도록 최선을 다하고 있습니다. 개인정보를 보호하는데 있어 귀하께 고지한 사항들에 반하는 사고가 발생할 경우 개인정보보호책임자가 책임을 집니다. 그러나 기술적인 보완조치를 했음에도 불구하고, 해킹 등 기본적인 네트워크 상의 위험성에 의해 발생하는 예기치 못한 사고로 인한 개인정보의 훼손 및 방문자가 작성한 게시물에 의한 각종 분쟁에 관해서 회사는 책임이 없습니다. 귀하의 개인정보를 취급하는 책임자 및 담당자는 다음과 같으며 개인정보 관련 문의사항에 신속하고 성실하게 답변해드리고 있습니다.다. 개인정보 보호책임자 및 담당자 회사는 회원이 좋은 정보를 안전하게 이용할 수 있도록 최선을 다하고 있습니다. 개인정보를 보호하는데 있어 귀하께 고지한 사항들에 반하는 사고가 발생할 경우 개인정보보호책임자가 책임을 집니다. 그러나 기술적인 보완조치를 했음에도 불구하고, 해킹 등 기본적인 네트워크 상의 위험성에 의해 발생하는 예기치 못한 사고로 인한 개인정보의 훼손 및 방문자가 작성한 게시물에 의한 각종 분쟁에 관해서 회사는 책임이 없습니다. 귀하의 개인정보를 취급하는 책임자 및 담당자는 다음과 같으며 개인정보 관련 문의사항에 신속하고 성실하게 답변해드리고 있습니다.<br><br>
                        - 개인정보 보호책임자 : 오한진<br>	
                        - 소속/직위 : 전락기획팀/이사<br>
                        - 전화번호 : 070-5001-3939<br>
                        - 이메일 : hanjin@rexsw.com<br><br>
                        - 개인정보 관리실무자 : 유진<br>
                        - 소속/직위 : 전략기획팀/매니저	<br>	
                        - 전화번호 : 070-5001-3939<br>
                        - 이메일 : jin@rexsw.com<br><br>

                        <div class="txtBold">8.개인정보 처리방침 변경</div>
                        본 개인정보 처리방침은 2022.04.15부터 적용됩니다. 관련 법령 및 방침에 따른 변경내용의 추가, 삭제 및 정정이 있는 경우에는 공지사항을 통하여 고지할 것입니다.<br>
                        “회사”는 개인정보 처리방침을 변경하는 경우에 개인정보주체인 회원이 그 변경 여부, 변경된 사항의 시행시기와 변경된 내용을 언제든지 쉽게 알 수 있도록 지속적으로 "서비스"를 통하여 공개합니다. 이 경우에 변경된 내용은 변경 전과 후를 비교하여 공개합니다.<br><br>

                        <div class="txtBold">부칙</div>
                        ※ 본 약관은 2022년 04월 15일부터 적용합니다.

                        </div>
                    </b-card-text>
                </b-card>
            </div><!--서비스정책-->
        </b-tab>
    </b-tabs>
   
  </div><!--content-->

  
</template>
<script>
export default {
        data() {
        return {
            idEmail: 'abcd@rexsw.com',
            examDate: '2022-01-27'
        };
    },
};
</script>